susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32L47x.h
#define SAI1_SD_B_PB5_ PB5,GPIO_AF13
#define SAI1_SD_B_PE3_ PE3,GPIO_AF13
#define SAI1_SD_B_PE7_ PE7,GPIO_AF13
#define SAI1_SD_B_PF6_ PF6,GPIO_AF13
#define _SAI1_SD_B_PB5_ 1
#define _SAI1_SD_B_PE3_ 1
#define _SAI1_SD_B_PE7_ 1
#define _SAI1_SD_B_PF6_ 1

#define SAI2_EXTCLK_PA2_ PA2,GPIO_AF13
#define SAI2_EXTCLK_PC9_ PC9,GPIO_AF13
#define _SAI2_EXTCLK_PA2_ 1
#define _SAI2_EXTCLK_PC9_ 1

#define SAI2_FS_A_PB12_ PB12,GPIO_AF13
#define SAI2_FS_A_PD12_ PD12,GPIO_AF13
#define SAI2_FS_A_PG10_ PG10,GPIO_AF13
#define _SAI2_FS_A_PB12_ 1
#define _SAI2_FS_A_PD12_ 1
#define _SAI2_FS_A_PG10_ 1

#define SAI2_FS_B_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF13
#define SAI2_FS_B_PG3_ PG3,GPIO_AF13
#define _SAI2_FS_B_PA15 (JTDI)_ 1
#define _SAI2_FS_B_PG3_ 1

#define SAI2_MCLK_A_PB14_ PB14,GPIO_AF13
#define SAI2_MCLK_A_PC6_ PC6,GPIO_AF13
#define SAI2_MCLK_A_PD9_ PD9,GPIO_AF13
#define SAI2_MCLK_A_PG11_ PG11,GPIO_AF13
#define _SAI2_MCLK_A_PB14_ 1
#define _SAI2_MCLK_A_PC6_ 1
#define _SAI2_MCLK_A_PD9_ 1
#define _SAI2_MCLK_A_PG11_ 1

#define SAI2_MCLK_B_PC11_ PC11,GPIO_AF13
#define SAI2_MCLK_B_PC7_ PC7,GPIO_AF13
#define SAI2_MCLK_B_PG4_ PG4,GPIO_AF13
#define _SAI2_MCLK_B_PC11_ 1
#define _SAI2_MCLK_B_PC7_ 1
#define _SAI2_MCLK_B_PG4_ 1

#define SAI2_SCK_A_PB13_ PB13,GPIO_AF13
#define SAI2_SCK_A_PD10_ PD10,GPIO_AF13
#define SAI2_SCK_A_PG9_ PG9,GPIO_AF13
#define _SAI2_SCK_A_PB13_ 1
#define _SAI2_SCK_A_PD10_ 1
#define _SAI2_SCK_A_PG9_ 1

#define SAI2_SCK_B_PC10_ PC10,GPIO_AF13
#define SAI2_SCK_B_PG2_ PG2,GPIO_AF13
#define _SAI2_SCK_B_PC10_ 1
#define _SAI2_SCK_B_PG2_ 1

#define SAI2_SD_A_PB15_ PB15,GPIO_AF13
#define SAI2_SD_A_PD11_ PD11,GPIO_AF13
#define SAI2_SD_A_PG12_ PG12,GPIO_AF13
#define _SAI2_SD_A_PB15_ 1
#define _SAI2_SD_A_PD11_ 1
#define _SAI2_SD_A_PG12_ 1

#define SAI2_SD_B_PC12_ PC12,GPIO_AF13
#define SAI2_SD_B_PG5_ PG5,GPIO_AF13
#define _SAI2_SD_B_PC12_ 1
#define _SAI2_SD_B_PG5_ 1

#define SDMMC1_CK_PC12_ PC12,GPIO_AF12
#define _SDMMC1_CK_PC12_ 1

#define SDMMC1_CMD_PD2_ PD2,GPIO_AF12
#define _SDMMC1_CMD_PD2_ 1

#define SDMMC1_D0_PC8_ PC8,GPIO_AF12
#define _SDMMC1_D0_PC8_ 1

#define SDMMC1_D1_PC9_ PC9,GPIO_AF12
#define _SDMMC1_D1_PC9_ 1

#define SDMMC1_D2_PC10_ PC10,GPIO_AF12
#define _SDMMC1_D2_PC10_ 1

#define SDMMC1_D3_PC11_ PC11,GPIO_AF12
#define _SDMMC1_D3_PC11_ 1

#define SDMMC1_D4_PB8_ PB8,GPIO_AF12
#define _SDMMC1_D4_PB8_ 1

#define SDMMC1_D5_PB9_ PB9,GPIO_AF12
#define _SDMMC1_D5_PB9_ 1

#define SDMMC1_D6_PC6_ PC6,GPIO_AF12
#define _SDMMC1_D6_PC6_ 1

#define SDMMC1_D7_PC7_ PC7,GPIO_AF12
#define _SDMMC1_D7_PC7_ 1

#define SPI1_MISO_PA6_ PA6,GPIO_AF5
#define SPI1_MISO_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF5
#define SPI1_MISO_PE14_ PE14,GPIO_AF5
#define SPI1_MISO_PG3_ PG3,GPIO_AF5
#define _SPI1_MISO_PA6_ 1
#define _SPI1_MISO_PB4 (NJTRST)_ 1
#define _SPI1_MISO_PE14_ 1
#define _SPI1_MISO_PG3_ 1

#define SPI1_MOSI_PA7_ PA7,GPIO_AF5
#define SPI1_MOSI_PB5_ PB5,GPIO_AF5
#define SPI1_MOSI_PE15_ PE15,GPIO_AF5
#define SPI1_MOSI_PG4_ PG4,GPIO_AF5
#define _SPI1_MOSI_PA7_ 1
#define _SPI1_MOSI_PB5_ 1
#define _SPI1_MOSI_PE15_ 1
#define _SPI1_MOSI_PG4_ 1

#define SPI1_NSS_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF5
#define SPI1_NSS_PA4_ PA4,GPIO_AF5
#define SPI1_NSS_PE12_ PE12,GPIO_AF5
#define SPI1_NSS_PG5_ PG5,GPIO_AF5
#define _SPI1_NSS_PA15 (JTDI)_ 1
#define _SPI1_NSS_PA4_ 1
#define _SPI1_NSS_PE12_ 1
#define _SPI1_NSS_PG5_ 1

#define SPI1_SCK_PA5_ PA5,GPIO_AF5
#define SPI1_SCK_PB3 (JTDO_ PB3 (JTDO,GPIO_AF5
#define SPI1_SCK_PE13_ PE13,GPIO_AF5
#define SPI1_SCK_PG2_ PG2,GPIO_AF5
#define _SPI1_SCK_PA5_ 1
#define _SPI1_SCK_PB3 (JTDO_ 1
#define _SPI1_SCK_PE13_ 1
#define _SPI1_SCK_PG2_ 1

#define SPI2_MISO_PB14_ PB14,GPIO_AF5
#define SPI2_MISO_PC2_ PC2,GPIO_AF5
#define SPI2_MISO_PD3_ PD3,GPIO_AF5
#define _SPI2_MISO_PB14_ 1
#define _SPI2_MISO_PC2_ 1
#define _SPI2_MISO_PD3_ 1

#define SPI2_MOSI_PB15_ PB15,GPIO_AF5
#define SPI2_MOSI_PC3_ PC3,GPIO_AF5
#define SPI2_MOSI_PD4_ PD4,GPIO_AF5
#define _SPI2_MOSI_PB15_ 1
#define _SPI2_MOSI_PC3_ 1
#define _SPI2_MOSI_PD4_ 1

#define SPI2_NSS_PB12_ PB12,GPIO_AF5
#define SPI2_NSS_PB9_ PB9,GPIO_AF5
#define SPI2_NSS_PD0_ PD0,GPIO_AF5
#define _SPI2_NSS_PB12_ 1
#define _SPI2_NSS_PB9_ 1
#define _SPI2_NSS_PD0_ 1

#define SPI2_SCK_PB10_ PB10,GPIO_AF5
#define SPI2_SCK_PB13_ PB13,GPIO_AF5
#define SPI2_SCK_PD1_ PD1,GPIO_AF5
#define _SPI2_SCK_PB10_ 1
#define _SPI2_SCK_PB13_ 1
#define _SPI2_SCK_PD1_ 1

#define SPI3_MISO_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF6
#define SPI3_MISO_PC11_ PC11,GPIO_AF6
#define SPI3_MISO_PG10_ PG10,GPIO_AF6
#define _SPI3_MISO_PB4 (NJTRST)_ 1
#define _SPI3_MISO_PC11_ 1
#define _SPI3_MISO_PG10_ 1

#define SPI3_MOSI_PB5_ PB5,GPIO_AF6
#define SPI3_MOSI_PC12_ PC12,GPIO_AF6
#define SPI3_MOSI_PG11_ PG11,GPIO_AF6
#define _SPI3_MOSI_PB5_ 1
#define _SPI3_MOSI_PC12_ 1
#define _SPI3_MOSI_PG11_ 1

#define SPI3_NSS_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF6
#define SPI3_NSS_PA4_ PA4,GPIO_AF6
#define SPI3_NSS_PG12_ PG12,GPIO_AF6
#define _SPI3_NSS_PA15 (JTDI)_ 1
#define _SPI3_NSS_PA4_ 1
#define _SPI3_NSS_PG12_ 1

#define SPI3_SCK_PB3 (JTDO_ PB3 (JTDO,GPIO_AF6
#define SPI3_SCK_PC10_ PC10,GPIO_AF6
#define SPI3_SCK_PG9_ PG9,GPIO_AF6
#define _SPI3_SCK_PB3 (JTDO_ 1
#define _SPI3_SCK_PC10_ 1
#define _SPI3_SCK_PG9_ 1

#define SWPMI1_IO_PB12_ PB12,GPIO_AF12
#define _SWPMI1_IO_PB12_ 1

#define SWPMI1_RX_PB14_ PB14,GPIO_AF12
#define _SWPMI1_RX_PB14_ 1

#define SWPMI1_SUSPEND_PB15_ PB15,GPIO_AF12
#define _SWPMI1_SUSPEND_PB15_ 1

#define SWPMI1_TX_PB13_ PB13,GPIO_AF12
#define _SWPMI1_TX_PB13_ 1

#define SYS_JTCK_SWCLK_PA14 (JTCK_ PA14 (JTCK,GPIO_AF0
#define _SYS_JTCK_SWCLK_PA14 (JTCK_ 1

#define SYS_JTDI_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF0
#define _SYS_JTDI_PA15 (JTDI)_ 1

#define SYS_JTDO_SWO_PB3 (JTDO_ PB3 (JTDO,GPIO_AF0
#define _SYS_JTDO_SWO_PB3 (JTDO_ 1

#define SYS_JTMS_SWDIO_PA13 (JTMS_ PA13 (JTMS,GPIO_AF0
#define _SYS_JTMS_SWDIO_PA13 (JTMS_ 1

#define SYS_JTRST_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF0
#define _SYS_JTRST_PB4 (NJTRST)_ 1

#define SYS_TRACECLK_PE2_ PE2,GPIO_AF0
#define _SYS_TRACECLK_PE2_ 1

#define SYS_TRACED0_PE3_ PE3,GPIO_AF0
#define _SYS_TRACED0_PE3_ 1

#define SYS_TRACED1_PE4_ PE4,GPIO_AF0
#define _SYS_TRACED1_PE4_ 1

#define SYS_TRACED2_PE5_ PE5,GPIO_AF0
#define _SYS_TRACED2_PE5_ 1

