susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32L47x.h
#define UART3_TX_PB10_ PB10,GPIO_AF7
#define UART3_TX_PC10_ PC10,GPIO_AF7
#define UART3_TX_PC4_ PC4,GPIO_AF7
#define UART3_TX_PD8_ PD8,GPIO_AF7
#define _UART3_TX_PB10_ 1
#define _UART3_TX_PC10_ 1
#define _UART3_TX_PC4_ 1
#define _UART3_TX_PD8_ 1

#define UART4_CTS_PB7_ PB7,GPIO_AF8
#define _UART4_CTS_PB7_ 1

#define UART4_DE_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF8
#define _UART4_DE_PA15 (JTDI)_ 1

#define UART4_RTS_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF8
#define _UART4_RTS_PA15 (JTDI)_ 1

#define UART4_RX_PA1_ PA1,GPIO_AF8
#define UART4_RX_PC11_ PC11,GPIO_AF8
#define _UART4_RX_PA1_ 1
#define _UART4_RX_PC11_ 1

#define UART4_TX_PA0_ PA0,GPIO_AF8
#define UART4_TX_PC10_ PC10,GPIO_AF8
#define _UART4_TX_PA0_ 1
#define _UART4_TX_PC10_ 1

#define UART5_CTS_PB5_ PB5,GPIO_AF8
#define _UART5_CTS_PB5_ 1

#define UART5_DE_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF8
#define _UART5_DE_PB4 (NJTRST)_ 1

#define UART5_RTS_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF8
#define _UART5_RTS_PB4 (NJTRST)_ 1

#define UART5_RX_PD2_ PD2,GPIO_AF8
#define _UART5_RX_PD2_ 1

#define UART5_TX_PC12_ PC12,GPIO_AF8
#define _UART5_TX_PC12_ 1

#define UART6_CTS_PB13_ PB13,GPIO_AF8
#define UART6_CTS_PG5_ PG5,GPIO_AF8
#define _UART6_CTS_PB13_ 1
#define _UART6_CTS_PG5_ 1

#define UART6_DE_PB12_ PB12,GPIO_AF8
#define UART6_DE_PG6_ PG6,GPIO_AF8
#define _UART6_DE_PB12_ 1
#define _UART6_DE_PG6_ 1

#define UART6_RTS_PB12_ PB12,GPIO_AF8
#define UART6_RTS_PG6_ PG6,GPIO_AF8
#define _UART6_RTS_PB12_ 1
#define _UART6_RTS_PG6_ 1

#define UART6_RX_PB10_ PB10,GPIO_AF8
#define UART6_RX_PC0_ PC0,GPIO_AF8
#define UART6_RX_PG8_ PG8,GPIO_AF8
#define _UART6_RX_PB10_ 1
#define _UART6_RX_PC0_ 1
#define _UART6_RX_PG8_ 1

#define UART6_TX_PB11_ PB11,GPIO_AF8
#define UART6_TX_PC1_ PC1,GPIO_AF8
#define UART6_TX_PG7_ PG7,GPIO_AF8
#define _UART6_TX_PB11_ 1
#define _UART6_TX_PC1_ 1
#define _UART6_TX_PG7_ 1

#define USART1_CK_PA8_ PA8,GPIO_AF7
#define USART1_CK_PB5_ PB5,GPIO_AF7
#define USART1_CK_PG13_ PG13,GPIO_AF7
#define _USART1_CK_PA8_ 1
#define _USART1_CK_PB5_ 1
#define _USART1_CK_PG13_ 1

#define USART1_CTS_PA11_ PA11,GPIO_AF7
#define USART1_CTS_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF7
#define USART1_CTS_PG11_ PG11,GPIO_AF7
#define _USART1_CTS_PA11_ 1
#define _USART1_CTS_PB4 (NJTRST)_ 1
#define _USART1_CTS_PG11_ 1

#define USART1_DE_PA12_ PA12,GPIO_AF7
#define USART1_DE_PB3 (JTDO_ PB3 (JTDO,GPIO_AF7
#define USART1_DE_PG12_ PG12,GPIO_AF7
#define _USART1_DE_PA12_ 1
#define _USART1_DE_PB3 (JTDO_ 1
#define _USART1_DE_PG12_ 1

#define USART1_RTS_PA12_ PA12,GPIO_AF7
#define USART1_RTS_PB3 (JTDO_ PB3 (JTDO,GPIO_AF7
#define USART1_RTS_PG12_ PG12,GPIO_AF7
#define _USART1_RTS_PA12_ 1
#define _USART1_RTS_PB3 (JTDO_ 1
#define _USART1_RTS_PG12_ 1

#define USART1_RX_PA10_ PA10,GPIO_AF7
#define USART1_RX_PB7_ PB7,GPIO_AF7
#define USART1_RX_PG10_ PG10,GPIO_AF7
#define _USART1_RX_PA10_ 1
#define _USART1_RX_PB7_ 1
#define _USART1_RX_PG10_ 1

#define USART1_TX_PA9_ PA9,GPIO_AF7
#define USART1_TX_PB6_ PB6,GPIO_AF7
#define USART1_TX_PG9_ PG9,GPIO_AF7
#define _USART1_TX_PA9_ 1
#define _USART1_TX_PB6_ 1
#define _USART1_TX_PG9_ 1

#define USART2_CK_PA4_ PA4,GPIO_AF7
#define USART2_CK_PD7_ PD7,GPIO_AF7
#define _USART2_CK_PA4_ 1
#define _USART2_CK_PD7_ 1

#define USART2_CTS_PA0_ PA0,GPIO_AF7
#define USART2_CTS_PD3_ PD3,GPIO_AF7
#define _USART2_CTS_PA0_ 1
#define _USART2_CTS_PD3_ 1

#define USART2_DE_PA1_ PA1,GPIO_AF7
#define USART2_DE_PD4_ PD4,GPIO_AF7
#define _USART2_DE_PA1_ 1
#define _USART2_DE_PD4_ 1

#define USART2_RTS_PA1_ PA1,GPIO_AF7
#define USART2_RTS_PD4_ PD4,GPIO_AF7
#define _USART2_RTS_PA1_ 1
#define _USART2_RTS_PD4_ 1

#define USART2_RX_PA3_ PA3,GPIO_AF7
#define USART2_RX_PD6_ PD6,GPIO_AF7
#define _USART2_RX_PA3_ 1
#define _USART2_RX_PD6_ 1

#define USART2_TX_PA2_ PA2,GPIO_AF7
#define USART2_TX_PD5_ PD5,GPIO_AF7
#define _USART2_TX_PA2_ 1
#define _USART2_TX_PD5_ 1

#define USART3_CK_PB0_ PB0,GPIO_AF7
#define USART3_CK_PB12_ PB12,GPIO_AF7
#define USART3_CK_PC12_ PC12,GPIO_AF7
#define USART3_CK_PD10_ PD10,GPIO_AF7
#define _USART3_CK_PB0_ 1
#define _USART3_CK_PB12_ 1
#define _USART3_CK_PC12_ 1
#define _USART3_CK_PD10_ 1

#define USART3_CTS_PA6_ PA6,GPIO_AF7
#define USART3_CTS_PB13_ PB13,GPIO_AF7
#define USART3_CTS_PD11_ PD11,GPIO_AF7
#define _USART3_CTS_PA6_ 1
#define _USART3_CTS_PB13_ 1
#define _USART3_CTS_PD11_ 1

#define USART3_DE_PB1_ PB1,GPIO_AF7
#define USART3_DE_PB14_ PB14,GPIO_AF7
#define USART3_DE_PD12_ PD12,GPIO_AF7
#define USART3_DE_PD2_ PD2,GPIO_AF7
#define _USART3_DE_PB1_ 1
#define _USART3_DE_PB14_ 1
#define _USART3_DE_PD12_ 1
#define _USART3_DE_PD2_ 1

#define USART3_RTS_PB1_ PB1,GPIO_AF7
#define USART3_RTS_PB14_ PB14,GPIO_AF7
#define USART3_RTS_PD12_ PD12,GPIO_AF7
#define USART3_RTS_PD2_ PD2,GPIO_AF7
#define _USART3_RTS_PB1_ 1
#define _USART3_RTS_PB14_ 1
#define _USART3_RTS_PD12_ 1
#define _USART3_RTS_PD2_ 1

#define USART3_RX_PB11_ PB11,GPIO_AF7
#define USART3_RX_PC11_ PC11,GPIO_AF7
#define USART3_RX_PC5_ PC5,GPIO_AF7
#define USART3_RX_PD9_ PD9,GPIO_AF7
#define _USART3_RX_PB11_ 1
#define _USART3_RX_PC11_ 1
#define _USART3_RX_PC5_ 1
#define _USART3_RX_PD9_ 1

#define USART3_TX_PB10_ PB10,GPIO_AF7
#define USART3_TX_PC10_ PC10,GPIO_AF7
#define USART3_TX_PC4_ PC4,GPIO_AF7
#define USART3_TX_PD8_ PD8,GPIO_AF7
#define _USART3_TX_PB10_ 1
#define _USART3_TX_PC10_ 1
#define _USART3_TX_PC4_ 1
#define _USART3_TX_PD8_ 1

#define USB_OTG_FS_DM_PA11_ PA11,GPIO_AF10
#define _USB_OTG_FS_DM_PA11_ 1

#define USB_OTG_FS_DP_PA12_ PA12,GPIO_AF10
#define _USB_OTG_FS_DP_PA12_ 1

#define USB_OTG_FS_ID_PA10_ PA10,GPIO_AF10
#define _USB_OTG_FS_ID_PA10_ 1

#define USB_OTG_FS_NOE_PA13 (JTMS_ PA13 (JTMS,GPIO_AF10
#define USB_OTG_FS_NOE_PC9_ PC9,GPIO_AF10
#define _USB_OTG_FS_NOE_PA13 (JTMS_ 1
#define _USB_OTG_FS_NOE_PC9_ 1

#define USB_OTG_FS_SOF_PA8_ PA8,GPIO_AF10
#define _USB_OTG_FS_SOF_PA8_ 1

#endif /* LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION */